In [9]:
import pandas as pd
import numpy as np

from pandas import DataFrame, Series

In [3]:
ser1 = Series([0,1,2],index=['A','B','C'])
ser1

A    0
B    1
C    2
dtype: int64

In [4]:
ser2 = Series([3,4,5,6],index=['A','B','C','D'])
ser2

A    3
B    4
C    5
D    6
dtype: int64

In [5]:
ser1 + ser2   #D will display NaN.

A    3.0
B    5.0
C    7.0
D    NaN
dtype: float64

In [14]:
dframe1 = DataFrame(np.arange(4).reshape((2,2)),index=['Lahore','London'],columns=list('AB'))
dframe1

        A  B
Lahore  0  1
London  2  3

In [17]:
dframe2 = DataFrame(np.arange(9).reshape((3,3)),index=['Lahore','London', 'Tokyo'],columns=list('ADC'))
dframe2

        A  D  C
Lahore  0  1  2
London  3  4  5
Tokyo   6  7  8

In [18]:
dframe1 + dframe2

          A   B   C   D
Lahore  0.0 NaN NaN NaN
London  5.0 NaN NaN NaN
Tokyo   NaN NaN NaN NaN

In [19]:
dframe1.add(dframe2, fill_value=0)

          A    B    C    D
Lahore  0.0  1.0  2.0  1.0
London  5.0  3.0  5.0  4.0
Tokyo   6.0  NaN  8.0  7.0